:PROPERTIES:
:ID:       c6b21554-fd0e-461e-bc5a-2f27f0b6fb65
:END:
#+TITLE: Language Learning: Mining Workflows
#+CATEGORY: slips
#+TAGS:

** Extracting Anime Subtitles

#+name: konosubarashii
#+begin_src sh :results output :exports code
srt_file=/tmp/kono-subarashii.srt

cat $srt_file \
    | sed -e 's/\r$//g' \
    | grep -ve " --> " \
    | grep -ve '^[0-9]' \
    | grep -P '[^[:ascii:]]+' \
    | head -n30
#+end_src

#+RESULTS: konosubarashii
| 1                                 |
| ♬～                              |
| ギイィ…　グオオォ…。                |
| ♬～                              |
| ♬～                              |
| （ウォルバク）大丈夫？　ケガはない？   |
| （めぐみん）どうしたら               |
| お姉さんみたいになれますか？          |
| お嬢さん　お名前は？                |
| めぐみんです。                      |
| ＜紅い爆焔の焔が                    |
| 少女を照らし続けた。                |
| その熱さと輝きが                    |
| 彼女の心に焼きついた。               |
| これは後に                         |
| 稀代の大魔法使いとも→               |
| 極めて　頭がおかしい                |
| 爆裂魔法使いとも呼ばれる→            |
| 一人の少女の物語。                  |
| 彼女が故郷から旅立ち→               |
| 真の仲間たちと                      |
| 出会うまでの物語＞                  |
| （鳥のさえずり）                    |
| （川の音）                         |
| （地響き）                         |
| ((ウォルバク：めぐみん？             |
| あだ名かしら？                      |
| 本名です。                         |
| （ウォルバク）あぁ　そう…。          |
| （ウォルバク）いったい誰が　私の封印を |

*** Extract Uniq Characters

Probably better ways to do this

#+begin_src sh :var text=konosubarashii
extractchars() {
  echo "$1" | sed -e 's/\(.\)/\1\n/g' | sort | uniq
}

extractchars "$text" | head -n25 | tail -n10 | tr '\n' '|'
echo
extractchars "$text" | tail -n-10 | tr '\n' '|'
#+end_src

#+RESULTS:
| ぁ | あ | い | ィ | イ | う | ウ | え | お | ォ |
| 語 | 誰 | 輝 | 郷 | 間 | 音 | 響 | 頭 | 魔 | 鳥 |


